<h1><span style="text-align: center;">Pandas Lesson, Session - 6</span><h1>

**Missing value handling methods**

 1. <b>Deleting Rows</b> ----->if it has more than 70-75% of missing values
    
 2. <b>Replacing With Mean/Median/Mode (Imputation)</b>--->can be applied on a feature which has numeric data

 3. <b> Assigning An Unique Category</b>--->If a categorical feature has definite number of classes, we can assign another class
    
 4. <b>Predicting The Missing Values</b>---> we can predict the nulls with the help of a machine learning algorithm like linear regression

 5. <b>Using Algorithms Which Support Missing Values</b>--->KNN is a machine learning algorithm which works on the principle of distance measure.  This algorithm can be used when there are nulls present in the dataset.  KNN considers the missing values by taking the majority of the K nearest values

In [46]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline


gender=["M","F","M","F","M","F","M","F","M","F","M"]
clas = ["a","b",np.nan,"a","b","c","a",np.nan,"c",np.nan,"b"]
V1 = np.array([2,3,5,np.NaN,7,1,np.NaN,10,14,np.nan,6])
V2 = np.array([8,np.NaN,5,8,11,np.NaN,np.NaN,2,3,7,9])
V3 = np.array([np.NaN,130,59,160,120,75,np.NaN,100,150,125,np.nan])
dept = ["HR","IT","IT","HR","IT",np.nan,"HR","IT",np.nan,"HR","IT"]

df = pd.DataFrame({
         "gender": gender,
          "class": clas,
          "var1" : V1,
          "var2" : V2,
         "salary": V3,
         "dept"  : dept   })

df

   gender class  var1  var2  salary dept
0       M     a   2.0   8.0     NaN   HR
1       F     b   3.0   NaN   130.0   IT
2       M   NaN   5.0   5.0    59.0   IT
3       F     a   NaN   8.0   160.0   HR
4       M     b   7.0  11.0   120.0   IT
5       F     c   1.0   NaN    75.0  NaN
6       M     a   NaN   NaN     NaN   HR
7       F   NaN  10.0   2.0   100.0   IT
8       M     c  14.0   3.0   150.0  NaN
9       F   NaN   NaN   7.0   125.0   HR
10      M     b   6.0   9.0     NaN   IT

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   gender  11 non-null     object
 1   class   8 non-null      object
 2   var1    8 non-null      float64
 3   var2    8 non-null      float64
 4   salary  8 non-null      float64
 5   dept    9 non-null      object
dtypes: float64(3), object(3)
memory usage: 656.0+ bytes

In [4]:
df.isnull().sum()

gender    0
class     3
var1      3
var2      3
salary    3
dept      2
dtype: int64

In [6]:
type(np.nan)

float

In [7]:
np.empty(3)

array([1.5e-323, 1.5e-323, 1.5e-323])

In [8]:
df.dropna()

  gender class  var1  var2  salary dept
4      M     b   7.0  11.0   120.0   IT

In [9]:
df.isnull().sum() / len(df)

gender    0.000000
class     0.272727
var1      0.272727
var2      0.272727
salary    0.272727
dept      0.181818
dtype: float64

In [11]:
df.salary.isnull().sum()

3

In [12]:
df.isnull().any()

gender    False
class      True
var1       True
var2       True
salary     True
dept       True
dtype: bool

In [13]:
df.isnull().all()

gender    False
class     False
var1      False
var2      False
salary    False
dept      False
dtype: bool

In [14]:
df.isnull().any(axis = 1)

0      True
1      True
2      True
3      True
4     False
5      True
6      True
7      True
8      True
9      True
10     True
dtype: bool

In [17]:
df[ df.isnull( ).any(axis =1) ]

   gender class  var1  var2  salary dept
0       M     a   2.0   8.0     NaN   HR
1       F     b   3.0   NaN   130.0   IT
2       M   NaN   5.0   5.0    59.0   IT
3       F     a   NaN   8.0   160.0   HR
5       F     c   1.0   NaN    75.0  NaN
6       M     a   NaN   NaN     NaN   HR
7       F   NaN  10.0   2.0   100.0   IT
8       M     c  14.0   3.0   150.0  NaN
9       F   NaN   NaN   7.0   125.0   HR
10      M     b   6.0   9.0     NaN   IT

In [18]:
df[ ~ (df.isnull( ).any(axis =1)) ]

  gender class  var1  var2  salary dept
4      M     b   7.0  11.0   120.0   IT

In [20]:
df["class"].fillna("other")

0         a
1         b
2     other
3         a
4         b
5         c
6         a
7     other
8         c
9     other
10        b
Name: class, dtype: object

In [22]:
df["salary"].fillna(2000)

0     2000.0
1      130.0
2       59.0
3      160.0
4      120.0
5       75.0
6     2000.0
7      100.0
8      150.0
9      125.0
10    2000.0
Name: salary, dtype: float64

In [23]:
df["salary"].fillna(  df["salary"].mean()  )

0     114.875
1     130.000
2      59.000
3     160.000
4     120.000
5      75.000
6     114.875
7     100.000
8     150.000
9     125.000
10    114.875
Name: salary, dtype: float64

In [24]:
sal = df["salary"].mean()
df["salary"].fillna( sal  )

0     114.875
1     130.000
2      59.000
3     160.000
4     120.000
5      75.000
6     114.875
7     100.000
8     150.000
9     125.000
10    114.875
Name: salary, dtype: float64

In [25]:
sal = df["salary"].median()
df["salary"].fillna( sal  )

0     122.5
1     130.0
2      59.0
3     160.0
4     120.0
5      75.0
6     122.5
7     100.0
8     150.0
9     125.0
10    122.5
Name: salary, dtype: float64

In [35]:
df

   gender class  var1  var2  salary dept
0       M     a   2.0   8.0     NaN   HR
1       F     b   3.0   NaN   130.0   IT
2       M   NaN   5.0   5.0    59.0   IT
3       F     a   NaN   8.0   160.0   HR
4       M     b   7.0  11.0   120.0   IT
5       F     c   1.0   NaN    75.0  NaN
6       M     a   NaN   NaN     NaN   HR
7       F   NaN  10.0   2.0   100.0   IT
8       M     c  14.0   3.0   150.0  NaN
9       F   NaN   NaN   7.0   125.0   HR
10      M     b   6.0   9.0     NaN   IT

In [40]:
df [df.salary.isnull() ]

   gender class  var1  var2  salary dept
0       M     a   2.0   8.0     NaN   HR
6       M     a   NaN   NaN     NaN   HR
10      M     b   6.0   9.0     NaN   IT

In [42]:
df.loc[ [0,6,10] , "salary"  ]

0    NaN
6    NaN
10   NaN
Name: salary, dtype: float64

In [45]:
df.loc[ df.salary.isnull() , "salary"  ]  = -111
df

   gender class  var1  var2  salary dept
0       M     a   2.0   8.0  -111.0   HR
1       F     b   3.0   NaN   130.0   IT
2       M   NaN   5.0   5.0    59.0   IT
3       F     a   NaN   8.0   160.0   HR
4       M     b   7.0  11.0   120.0   IT
5       F     c   1.0   NaN    75.0  NaN
6       M     a   NaN   NaN  -111.0   HR
7       F   NaN  10.0   2.0   100.0   IT
8       M     c  14.0   3.0   150.0  NaN
9       F   NaN   NaN   7.0   125.0   HR
10      M     b   6.0   9.0  -111.0   IT

In [ ]:
df.loc[ df.salary.isnull() , "salary"  ]  = df.salary.
df